import java.util.Scanner;
public class Main {
    /* --------------------------------------ФУНКЦИЯ ПЕРЕВОРОТА МАССИВА -------------------------------------------*/
    public void sort( int[] massive ) {
          int[] arraySort = new int[massive.length];
          for (int i = massive.length-1; i >= 0; i--) {
              arraySort[massive.length-1 - i] = massive[i];
          }
        System.arraycopy (arraySort, 0, massive, 0, massive.length);
    }
/* ---------------------------------------------ФУНКЦИЯ ПОЛИНДРОМНОСТИ-------------------------------------------*/
    static void palindrome( int[] arr )
    {
        int flag = 0;
        for (int i = 0; i <= arr.length / 2 && arr.length != 0; i++) {
            if (arr[i] != arr[arr.length - i - 1]) {
                flag = 1;
                break;
            }
        }
        if (flag == 1)
            System.out.println("Массив не полиндромен");
        else
            System.out.println("Массив полиндромен");
    }
/* -------------------------------------------------------------------------------------------------------------------------*/
    public static void main( ) {
        int[] arrAlMass = {1,1,1,1,1,1};
        int lengthMass= 6;
        int num;
        int summaCH=0;

/* ---------------------------------------СЧИТЫВАНИЕ ПЕРЕМЕННЫХ МАССИВА С КЛАВИАТУРЫ--------------------------------------------------*/
        System.out.println ("Введите аргумент массива:");
        for (int j=0; j<=lengthMass-1; j++ ) {
            Scanner sc = new Scanner(System.in);
            arrAlMass[j] = sc.nextInt ();
/* ---------------------------------------ЛОГИКА СЛОЖЕНИЯ ЧЕТНЫХ ЧИСЕЛ В ЧЕТНОЙ ПОЗИЦИИ----------------------------------------------------------------------------------*/
            num = j+1;
            if ((num%2)==1) {if ((arrAlMass[j]%2)<1) {
                summaCH=summaCH+arrAlMass[j];
            }}System.out.println(" ");
        }
 /* -----------------------------------ОБЬЯВЛЕНИЕ МАССИВА С ДАННЫМИ ПРИНЯТЫМИ С КЛАВИАТУРЫ------------------------------------*/
        int [] arAlMass = {arrAlMass[0], arrAlMass[1], arrAlMass[2], arrAlMass[3], arrAlMass[4], arrAlMass[5]};

        System.out.println ("____________________________________________");
/* -------------------------------------------------------ПЕРЕВОРОТ МАССИВА-------------------------------------------------------*/
        Main m = new Main ();
        m.sort (arAlMass);
/* -----------------------------------------------ВЫВОД НА ЭКРАН ПЕРЕВЕРНУТОГО МАССИВА------------------------------------------------------------------*/
        for (int a : arAlMass) {
            System.out.printf (String.valueOf (a) + ' ' + ' ');
        }System.out.print (" Reversed массив"); System.out.println (" ");

        System.out.println ("____________________________________________");
/* ---------------------------------------ВЫВОД РЕЗУЛЬТАТА ПО СУММЕ ЧЕТНЫХ ЧИСЕЛ В ЧЕТНЫХ ПОЗИЦИЯХ-----------------------------------------------------------------------*/
        System.out.println (StringTemplate.STR."\{summaCH} Сумма четных чисел массива еслиони четные позации Reversed массива");
/* --------------------------------------------вЫВОД РЕЗУЛЬТАТА ФУНКЦИИ ПОЛИНДРОМА------------------------------*/
        System.out.println ("____________________________________________");
        Main.palindrome(arAlMass);//функция палиндром
        System.out.println ("____________________________________________");
      }
    }